ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_Display.cpp
uint32_t m_LPC17_DisplayWidth = 0;
uint32_t m_LPC17_DisplayHeight = 0;
uint32_t m_LPC17_DisplayPixelClockRateKHz = 0;
uint32_t m_LPC17_DisplayHorizontalSyncPulseWidth = 0;
uint32_t m_LPC17_DisplayHorizontalFrontPorch = 0;
uint32_t m_LPC17_DisplayHorizontalBackPorch = 0;
uint32_t m_LPC17_DisplayVerticalSyncPulseWidth = 0;
uint32_t m_LPC17_DisplayVerticalFrontPorch = 0;
uint32_t m_LPC17_DisplayVerticalBackPorch = 0;
uint32_t m_LPC17_Display_TextRow = 0;
uint32_t m_LPC17_Display_TextColumn = 0;

bool m_LPC17_DisplayOutputEnableIsFixed = false;
bool m_LPC17_DisplayOutputEnablePolarity = false;
bool m_LPC17_DisplayPixelPolarity = false;
bool m_LPC17_DisplayHorizontalSyncPolarity = false;
bool m_LPC17_DisplayVerticalSyncPolarity = false;
bool m_LPC17_DisplayEnable = false;

uint16_t* m_LPC17_Display_VituralRam = nullptr;
size_t m_LPC17_DisplayBufferSize = 0;

uint8_t m_LPC17_Display_TextBuffer[LCD_MAX_COLUMN][LCD_MAX_ROW];

LPC17xx_LCD_Rotation m_LPC17_Display_CurrentRotation = LPC17xx_LCD_Rotation::rotateNormal_0;

bool LPC17_Display_Initialize();
bool LPC17_Display_Uninitialize();
bool LPC17_Display_SetPinConfiguration(bool enable);

void LPC17_Display_WriteFormattedChar(uint8_t c);
void LPC17_Display_WriteChar(uint8_t c, int32_t row, int32_t col);
void LPC17_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]);
void LPC17_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c);
void LPC17_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p);
void LPC17_Display_TextEnterClearMode();
void LPC17_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c);
void LPC17_Display_TextShiftColUp();
void LPC17_Display_Clear();
void LPC17_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight);

int32_t LPC17_Display_GetWidth();
int32_t LPC17_Display_GetHeight();
int32_t LPC17_Display_BitPerPixel();
uint32_t LPC17_Display_GetPixelClockDivider();
int32_t LPC17_Display_GetOrientation();
uint32_t* LPC17_Display_GetFrameBuffer();

#define TOTAL_DISPLAY_CONTROLLERS 1

static TinyCLR_Display_Controller displayControllers[TOTAL_DISPLAY_CONTROLLERS];
static TinyCLR_Api_Info displayApi[TOTAL_DISPLAY_CONTROLLERS];

bool LPC17_Display_Initialize() {
    int32_t i;
    uint32_t * p32;

    uint32_t newFreq;
    uint8_t divider;

    LPC17xx_LCDC & LCDC = *(LPC17xx_LCDC *)LPC17xx_LCDC::c_LCDC_Base;

    /* Power Up the LCD controller. */
    LPC_SC->PCONP |= LPC17xx_SYSCON::ENABLE_LCD;
    LPC17_Time_Delay(nullptr, 1000 * 10);

    /* Disable the display in case it is on */
    LCDC.LCD_CTRL = 0;
    LPC17_Time_Delay(nullptr, 1000 * 10);

    LCDC.LCD_TIMH = ((m_LPC17_DisplayHorizontalBackPorch - 1) << 24) | ((m_LPC17_DisplayHorizontalFrontPorch - 1) << 16) | ((m_LPC17_DisplayHorizontalSyncPulseWidth - 1) << 8) | (((m_LPC17_DisplayWidth / 16) - 1) << 2);//(1<<24)|(16<<16)|(40<<8)|(((480/16)-1)<<2);
    LCDC.LCD_TIMV = ((m_LPC17_DisplayVerticalBackPorch) << 24) | ((m_LPC17_DisplayVerticalFrontPorch) << 16) | ((m_LPC17_DisplayVerticalSyncPulseWidth - 1) << 10) | (m_LPC17_DisplayHeight - 1);//LPC17_Display_VerticalTimingReg;//(2<<24)|(16<<16)|(9<<10)|(271);
    LCDC.LCD_POL = (1 << 26) | ((m_LPC17_DisplayWidth - 1) << 16) | (!m_LPC17_DisplayOutputEnablePolarity << 14) | (m_LPC17_DisplayPixelPolarity << 13) | (!m_LPC17_DisplayHorizontalSyncPolarity << 12) | (!m_LPC17_DisplayVerticalSyncPolarity << 11);//LPC17_Display_PolarityReg;//(1<<26)|(479<<16)|(1<<14)|(0<<13)|(1<<12)|(1<<11);
    LCDC.LCD_LE = 0;//not used

    LCDC.LCD_INTMSK = 0;

    // don ot use grayscaler!!!?? manual
    LCDC.LCD_CTRL = (6 << 1) | (1 << 5) | (1 << 11) | (1 << 8)/*RGB*/ | (0 << 9)/*endian*/ | (0 << 10)/*pixel order*/;

    // clear pallete
    p32 = (uint32_t*)&LCDC.LCD_PAL;
    for (i = 0; i < 128; i++) {
        p32[i] = 0;
    }

    if (m_LPC17_DisplayPixelClockRateKHz == 0) {
        divider = 0xFF;
    }
    else {
        newFreq = (uint32_t)((LPC17_AHB_CLOCK_HZ / 1000) % m_LPC17_DisplayPixelClockRateKHz);

        if (newFreq != 0)
            divider = ((LPC17_AHB_CLOCK_HZ / 1000) / m_LPC17_DisplayPixelClockRateKHz) + 1;
        else
            divider = ((LPC17_AHB_CLOCK_HZ / 1000) / m_LPC17_DisplayPixelClockRateKHz);
    }

    LPC_SC->LCD_CFG = (divider - 1);

    if (m_LPC17_Display_VituralRam == nullptr)
        return false;

    LCDC.LCD_UPBASE = (uint32_t)&m_LPC17_Display_VituralRam[0];

    LPC17_Time_Delay(nullptr, 1000 * 10);

    LCDC.LCD_CTRL |= 1;//enable ....also add power

    LPC17_Time_Delay(nullptr, 1000 * 10);

    LPC17_Display_TextEnterClearMode();

    return true;
}

bool LPC17_Display_Uninitialize() {
    int32_t i;

    LPC17xx_LCDC & LCDC = *(LPC17xx_LCDC *)LPC17xx_LCDC::c_LCDC_Base;

    if (m_LPC17_DisplayEnable == false)
        return true;

    // powerdown
    LCDC.LCD_CTRL &= ~1;
    LPC17_Time_Delay(nullptr, 1000 * 10);
    LCDC.LCD_CTRL = 0;
    LPC17_Time_Delay(nullptr, 1000 * 10);

    return true;
}

//====================================================
void LPC17_Display_WriteFormattedChar(uint8_t c) {
    if (m_LPC17_DisplayEnable == false)
        return;

    if (c == '\f') {
        LPC17_Display_Clear();
        LPC17_Display_TextEnterClearMode();
        m_LPC17_Display_TextColumn = 0;

        return;
    }

    if (c == '\r') {
        m_LPC17_Display_TextColumn = 0;

        return;
    }
    if (c == '\n') {
        m_LPC17_Display_TextColumn = 0;

        if (++m_LPC17_Display_TextRow >= LCD_MAX_ROW) {
            m_LPC17_Display_TextRow = LCD_MAX_ROW - 1;
            LPC17_Display_TextShiftColUp();
        }
        // clean the new line
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_LPC17_Display_TextBuffer[c][m_LPC17_Display_TextRow] = ' ';
        }

        return;
    }

    LPC17_Display_PrintChracter(m_LPC17_Display_TextColumn * 6, m_LPC17_Display_TextRow * 8, c);
    m_LPC17_Display_TextBuffer[m_LPC17_Display_TextColumn][m_LPC17_Display_TextRow] = c;

    if (++m_LPC17_Display_TextColumn >= (LCD_MAX_COLUMN - 1)) {
        m_LPC17_Display_TextColumn = 0;

        if (++m_LPC17_Display_TextRow >= LCD_MAX_ROW) {
            m_LPC17_Display_TextRow = LCD_MAX_ROW - 1;
            LPC17_Display_TextShiftColUp();
        }
        else {
            // clean the new line
            for (c = 0; c < LCD_MAX_COLUMN; c++) {
                m_LPC17_Display_TextBuffer[c][m_LPC17_Display_TextRow] = ' ';
            }
        }
    }
}
//=======================================================
void LPC17_Display_PaintPixel(uint32_t x, uint32_t y, uint8_t c) {
    volatile uint16_t * loc;

    if (m_LPC17_DisplayEnable == false)
        return;

    if (x >= m_LPC17_DisplayWidth)
        return;
    if (y >= m_LPC17_DisplayHeight)
        return;

