ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_Display.cpp
    loc = m_LPC17_Display_VituralRam + (y *m_LPC17_DisplayWidth) + (x);

    if (c)
        *loc = 0x0fff;
    else
        *loc = 0;
}
//=======================================================
void LPC17_Display_Paint8HorizontalPixels(uint32_t x, uint32_t y, uint8_t p) {
    if (m_LPC17_DisplayEnable == false)
        return;

    for (int32_t i = 0; i < 8; i++) {
        if (p&(1 << i))
            LPC17_Display_PaintPixel(x, y + i, 1);
        else
            LPC17_Display_PaintPixel(x, y + i, 0);//clear
    }
}
//===========================================================
void LPC17_Display_TextEnterClearMode() {
    uint32_t r, c;

    if (m_LPC17_DisplayEnable == false)
        return;

    LPC17_Display_Clear();
    m_LPC17_Display_TextRow = 0;
    m_LPC17_Display_TextColumn = 0;

    for (r = 0; r < LCD_MAX_ROW; r++) {
        for (c = 0; c < (LCD_MAX_COLUMN - 1); c++) {
            m_LPC17_Display_TextBuffer[c][r] = '1';
        }
    }
}
//===========================================================
void LPC17_Display_PrintChracter(uint32_t x, uint32_t y, uint8_t c) {
    uint8_t i;

    if (m_LPC17_DisplayEnable == false)
        return;

    for (i = 0; i < 5; i++)
        LPC17_Display_Paint8HorizontalPixels(x + i, y, characters[c][i]);

    LPC17_Display_Paint8HorizontalPixels(x + i, y, 0);
}

void LPC17_Display_TextShiftColUp() {
    uint32_t r, c;

    if (m_LPC17_DisplayEnable == false)
        return;

    // refresh with new data
    LPC17_Display_Clear();
    m_LPC17_Display_TextRow = 0;
    m_LPC17_Display_TextColumn = 0;

    for (r = 0; r < (LCD_MAX_ROW - 1); r++) {
        for (c = 0; c < LCD_MAX_COLUMN - 1; c++) {
            m_LPC17_Display_TextBuffer[c][r] = m_LPC17_Display_TextBuffer[c][r + 1];
            LPC17_Display_WriteFormattedChar(m_LPC17_Display_TextBuffer[c][r]);
        }
    }
}

void LPC17_Display_Clear() {
    if (m_LPC17_DisplayEnable == false || m_LPC17_Display_VituralRam == nullptr)
        return;

    memset((uint32_t*)m_LPC17_Display_VituralRam, 0, m_LPC17_DisplayBufferSize);
}

const LPC17_Gpio_Pin g_Display_ControllerPins[] = LPC17_DISPLAY_CONTROLLER_PINS;
const LPC17_Gpio_Pin g_Display_BacklightPin = LPC17_DISPLAY_BACKLIGHT_PIN;
const LPC17_Gpio_Pin g_Display_EnablePin = LPC17_DISPLAY_ENABLE_PIN;

bool  LPC17_Display_SetPinConfiguration(bool enable) {
    if (enable) {
        for (auto i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
            if (!LPC17_Gpio_OpenPin(g_Display_ControllerPins[i].number)) {
                return false;
            }

            LPC17_Gpio_ConfigurePin(g_Display_ControllerPins[i].number, LPC17_Gpio_Direction::Input, g_Display_ControllerPins[i].pinFunction, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);
        }

        if (!LPC17_Gpio_OpenPin(g_Display_EnablePin.number)) {
            return false;
        }

        if (m_LPC17_DisplayOutputEnableIsFixed)
            LPC17_Gpio_EnableOutputPin(g_Display_EnablePin.number, m_LPC17_DisplayOutputEnablePolarity);
        else
            LPC17_Gpio_ConfigurePin(g_Display_EnablePin.number, LPC17_Gpio_Direction::Input, LPC17_Gpio_PinFunction::PinFunction7, LPC17_Gpio_ResistorMode::Inactive, LPC17_Gpio_Hysteresis::Disable, LPC17_Gpio_InputPolarity::NotInverted, LPC17_Gpio_SlewRate::StandardMode, LPC17_Gpio_OutputType::PushPull);

        if (g_Display_BacklightPin.number != PIN_NONE) {
            if (!LPC17_Gpio_OpenPin(g_Display_BacklightPin.number)) {
                return false;

            }

            LPC17_Gpio_EnableOutputPin(g_Display_BacklightPin.number, true);
        }
    }
    else {
        for (int32_t i = 0; i < SIZEOF_ARRAY(g_Display_ControllerPins); i++) {
            LPC17_Gpio_ClosePin(g_Display_ControllerPins[i].number);
        }

        LPC17_Gpio_ClosePin(g_Display_EnablePin.number);

        LPC17_Gpio_ClosePin(g_Display_BacklightPin.number);
    }

    return true;
}
uint32_t* LPC17_Display_GetFrameBuffer() {
    return (uint32_t*)m_LPC17_Display_VituralRam;
}

int32_t LPC17_Display_GetWidth() {
    int32_t width = m_LPC17_DisplayWidth;
    int32_t height = m_LPC17_DisplayHeight;

    LPC17_Display_GetRotatedDimensions(&width, &height);

    return width;
}

int32_t LPC17_Display_GetHeight() {
    int32_t width = m_LPC17_DisplayWidth;
    int32_t height = m_LPC17_DisplayHeight;

    LPC17_Display_GetRotatedDimensions(&width, &height);

    return height;
}

uint32_t LPC17_Display_GetPixelClockDivider() {
    return m_LPC17_DisplayPixelClockRateKHz;
}
int32_t LPC17_Display_GetOrientation() {
    return m_LPC17_Display_CurrentRotation;
}

void  LPC17_Display_MemCopy(void *dest, void *src, int32_t size) {
    const int32_t MEMCOPY_BYTES_ALIGNED = 8;

    uint64_t *from64 = (uint64_t *)src;
    uint64_t *to64 = (uint64_t *)dest;

    int32_t block = size / MEMCOPY_BYTES_ALIGNED;
    int32_t remainder = size % MEMCOPY_BYTES_ALIGNED;

    while (block > 0) {
        *to64++ = *from64++;
        block--;
    }

    if (remainder > 0) {
        uint8_t *from8 = (uint8_t *)from64;
        uint8_t *to8 = (uint8_t *)to64;

        while (remainder > 0) {
            *to8++ = *from8++;

            remainder--;
        }
    }
}

void LPC17_Display_BitBltEx(int32_t x, int32_t y, int32_t width, int32_t height, uint32_t data[]) {

    int32_t xTo, yTo, xFrom, yFrom;
    int32_t xOffset = x;
    int32_t yOffset = y;
    uint16_t *from = (uint16_t *)data;
    uint16_t *to = (uint16_t *)m_LPC17_Display_VituralRam;


    int32_t screenWidth = m_LPC17_DisplayWidth;
    int32_t screenHeight = m_LPC17_DisplayHeight;
    int32_t startPx, toAddition;

    if (m_LPC17_DisplayEnable == false)
        return;

    switch (m_LPC17_Display_CurrentRotation) {
    case LPC17xx_LCD_Rotation::rotateNormal_0:

        if (xOffset == 0 && yOffset == 0 &&
            width == screenWidth && height == screenHeight) {
            LPC17_Display_MemCopy(to, from, (screenWidth*screenHeight * 2));
        }
        else {
            for (yTo = yOffset; yTo < (yOffset + height); yTo++) {
                LPC17_Display_MemCopy((void*)(to + yTo * screenWidth + xOffset), (void*)(from + yTo * screenWidth + xOffset), (width * 2));
            }
        }

        break;

