ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_Display.cpp
    case LPC17xx_LCD_Rotation::rotateCCW_90:

        startPx = yOffset * screenHeight;
        xFrom = xOffset + width;
        yTo = screenHeight - xOffset - width;
        xTo = yOffset;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - height;

        for (; yTo < (screenHeight - xOffset); yTo++) {
            xFrom--;
            yFrom = startPx + xFrom;

            for (xTo = yOffset; xTo < (yOffset + height); xTo++) {
                *to++ = from[yFrom];
                yFrom += screenHeight;
            }

            to += toAddition;
        }

        break;

    case LPC17xx_LCD_Rotation::rotateCW_90:

        startPx = (yOffset + height - 1) * screenHeight;
        xFrom = xOffset;

        yTo = xOffset;
        xTo = screenWidth - yOffset - height;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - height;

        for (; yTo < (xOffset + width); yTo++) {
            yFrom = startPx + xFrom;

            for (xTo = screenWidth - yOffset - height; xTo < (screenWidth - yOffset); xTo++) {
                *to++ = from[yFrom];
                yFrom -= screenHeight;
            }

            to += toAddition;
            xFrom++;
        }

        break;

    case LPC17xx_LCD_Rotation::rotate_180:

        xFrom = (yOffset + height - 1) * screenWidth + xOffset + width;

        yTo = screenHeight - yOffset - height;
        xTo = screenWidth - xOffset - width;
        to += yTo * screenWidth + xTo;
        toAddition = screenWidth - width;

        for (; yTo < (screenHeight - yOffset); yTo++) {

            for (xTo = screenWidth - xOffset - width; xTo < (screenWidth - xOffset); xTo++) {
                xFrom--;
                *to++ = from[xFrom];
            }

            to += toAddition;
            xFrom -= toAddition;
        }

        break;
    }

}

void LPC17_Display_WriteChar(uint8_t c, int32_t row, int32_t col) {
    m_LPC17_Display_TextRow = row;
    m_LPC17_Display_TextColumn = col;
    LPC17_Display_WriteFormattedChar(c);

}
void LPC17_Display_GetRotatedDimensions(int32_t *screenWidth, int32_t *screenHeight) {
    switch (m_LPC17_Display_CurrentRotation) {
    case LPC17xx_LCD_Rotation::rotateNormal_0:
    case LPC17xx_LCD_Rotation::rotate_180:
        *screenWidth = m_LPC17_DisplayWidth;
        *screenHeight = m_LPC17_DisplayHeight;
        break;

    case LPC17xx_LCD_Rotation::rotateCCW_90:
    case LPC17xx_LCD_Rotation::rotateCW_90:
        *screenWidth = m_LPC17_DisplayHeight;
        *screenHeight = m_LPC17_DisplayWidth;
        break;
    }
}

TinyCLR_Result LPC17_Display_Acquire(const TinyCLR_Display_Controller* self) {
    m_LPC17_Display_CurrentRotation = LPC17xx_LCD_Rotation::rotateNormal_0;

    if (!LPC17_Display_SetPinConfiguration(true)) {
        return TinyCLR_Result::SharingViolation;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Display_Release(const TinyCLR_Display_Controller* self) {
    LPC17_Display_Uninitialize();

    LPC17_Display_SetPinConfiguration(false);

    m_LPC17_DisplayEnable = false;

    if (m_LPC17_Display_VituralRam != nullptr) {
        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        memoryProvider->Free(memoryProvider, m_LPC17_Display_VituralRam);

        m_LPC17_Display_VituralRam = nullptr;
    }

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Display_Enable(const TinyCLR_Display_Controller* self) {
    if (m_LPC17_DisplayEnable || LPC17_Display_Initialize()) {
        m_LPC17_DisplayEnable = true;

        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result LPC17_Display_Disable(const TinyCLR_Display_Controller* self) {
    LPC17_Display_Uninitialize();

    m_LPC17_DisplayEnable = false;

    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Display_SetConfiguration(const TinyCLR_Display_Controller* self, TinyCLR_Display_DataFormat dataFormat, uint32_t width, uint32_t height, const void* configuration) {
    if (dataFormat != TinyCLR_Display_DataFormat::Rgb565) return TinyCLR_Result::NotSupported;

    if (configuration != nullptr) {
        auto& cfg = *(const TinyCLR_Display_ParallelConfiguration*)configuration;

        m_LPC17_DisplayWidth = width;
        m_LPC17_DisplayHeight = height;

        m_LPC17_DisplayOutputEnableIsFixed = cfg.DataEnableIsFixed;
        m_LPC17_DisplayOutputEnablePolarity = cfg.DataEnablePolarity;
        m_LPC17_DisplayPixelPolarity = cfg.PixelPolarity;

        m_LPC17_DisplayPixelClockRateKHz = cfg.PixelClockRate / 1000;

        m_LPC17_DisplayHorizontalSyncPolarity = cfg.HorizontalSyncPolarity;

        m_LPC17_DisplayHorizontalSyncPulseWidth = cfg.HorizontalSyncPulseWidth;
        m_LPC17_DisplayHorizontalFrontPorch = cfg.HorizontalFrontPorch;
        m_LPC17_DisplayHorizontalBackPorch = cfg.HorizontalBackPorch;

        m_LPC17_DisplayVerticalSyncPolarity = cfg.VerticalSyncPolarity;

        m_LPC17_DisplayVerticalSyncPulseWidth = cfg.VerticalSyncPulseWidth;
        m_LPC17_DisplayVerticalFrontPorch = cfg.VerticalFrontPorch;
        m_LPC17_DisplayVerticalBackPorch = cfg.VerticalBackPorch;

        switch (dataFormat) {
        case TinyCLR_Display_DataFormat::Rgb565:
            m_LPC17_DisplayBufferSize = width * height * 2;
            break;

        default:
            // TODO 8 - 24 - 32 bits
            break;
        }

        auto memoryProvider = (const TinyCLR_Memory_Manager*)apiManager->FindDefault(apiManager, TinyCLR_Api_Type::MemoryManager);

        if (m_LPC17_Display_VituralRam != nullptr) {
            memoryProvider->Free(memoryProvider, m_LPC17_Display_VituralRam);

            m_LPC17_Display_VituralRam = nullptr;
        }

        m_LPC17_Display_VituralRam = (uint16_t*)((uint8_t*)memoryProvider->Allocate(memoryProvider, m_LPC17_DisplayBufferSize));

        if (m_LPC17_Display_VituralRam == nullptr) {
            return TinyCLR_Result::OutOfMemory;
        }
    }

    return  TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Display_GetConfiguration(const TinyCLR_Display_Controller* self, TinyCLR_Display_DataFormat& dataFormat, uint32_t& width, uint32_t& height, void* configuration) {
    dataFormat = TinyCLR_Display_DataFormat::Rgb565;
    width = m_LPC17_DisplayWidth;
    height = m_LPC17_DisplayHeight;

    if (configuration != nullptr) {
        auto& cfg = *(TinyCLR_Display_ParallelConfiguration*)configuration;

