ghi-electronics/TinyCLR-Ports/Targets/LPC177x_LPC178x/LPC17_Display.cpp
        cfg.DataEnableIsFixed = m_LPC17_DisplayOutputEnableIsFixed;
        cfg.DataEnablePolarity = m_LPC17_DisplayOutputEnablePolarity;
        cfg.PixelPolarity = m_LPC17_DisplayPixelPolarity;

        cfg.PixelClockRate = m_LPC17_DisplayPixelClockRateKHz * 1000;

        cfg.HorizontalSyncPolarity = m_LPC17_DisplayHorizontalSyncPolarity;

        cfg.HorizontalSyncPulseWidth = m_LPC17_DisplayHorizontalSyncPulseWidth;
        cfg.HorizontalFrontPorch = m_LPC17_DisplayHorizontalFrontPorch;
        cfg.HorizontalBackPorch = m_LPC17_DisplayHorizontalBackPorch;

        cfg.VerticalSyncPolarity = m_LPC17_DisplayVerticalSyncPolarity;

        cfg.VerticalSyncPulseWidth = m_LPC17_DisplayVerticalSyncPulseWidth;
        cfg.VerticalFrontPorch = m_LPC17_DisplayVerticalFrontPorch;
        cfg.VerticalBackPorch = m_LPC17_DisplayVerticalBackPorch;

        return TinyCLR_Result::Success;
    }

    return TinyCLR_Result::InvalidOperation;
}

TinyCLR_Result LPC17_Display_DrawBuffer(const TinyCLR_Display_Controller* self, int32_t x, int32_t y, int32_t width, int32_t height, const uint8_t* data) {
    LPC17_Display_BitBltEx(x, y, width, height, (uint32_t*)data);
    return TinyCLR_Result::Success;
}

TinyCLR_Result LPC17_Display_WriteString(const TinyCLR_Display_Controller* self, const char* buffer, size_t length) {
    for (size_t i = 0; i < length; i++)
        LPC17_Display_WriteFormattedChar(buffer[i]);

    return TinyCLR_Result::Success;
}

TinyCLR_Display_DataFormat dataFormats[] = { TinyCLR_Display_DataFormat::Rgb565 };

TinyCLR_Result LPC17_Display_GetCapabilities(const TinyCLR_Display_Controller* self, TinyCLR_Display_InterfaceType& type, const TinyCLR_Display_DataFormat*& supportedDataFormats, size_t& supportedDataFormatCount) {
    type = TinyCLR_Display_InterfaceType::Parallel;
    supportedDataFormatCount = SIZEOF_ARRAY(dataFormats);
    supportedDataFormats = dataFormats;

    return TinyCLR_Result::Success;
}

const TinyCLR_Api_Info* LPC17_Display_GetApi() {
    for (auto i = 0; i < TOTAL_DISPLAY_CONTROLLERS; i++) {
        displayControllers[i].ApiInfo = &displayApi[i];
        displayControllers[i].Acquire = &LPC17_Display_Acquire;
        displayControllers[i].Release = &LPC17_Display_Release;
        displayControllers[i].Enable = &LPC17_Display_Enable;
        displayControllers[i].Disable = &LPC17_Display_Disable;
        displayControllers[i].SetConfiguration = &LPC17_Display_SetConfiguration;
        displayControllers[i].GetConfiguration = &LPC17_Display_GetConfiguration;
        displayControllers[i].GetCapabilities = &LPC17_Display_GetCapabilities;
        displayControllers[i].DrawBuffer = &LPC17_Display_DrawBuffer;
        displayControllers[i].WriteString = &LPC17_Display_WriteString;

        displayApi[i].Author = "GHI Electronics, LLC";
        displayApi[i].Name = "GHIElectronics.TinyCLR.NativeApis.LPC17.DisplayController";
        displayApi[i].Type = TinyCLR_Api_Type::DisplayController;
        displayApi[i].Version = 0;
        displayApi[i].Implementation = &displayControllers[i];
        displayApi[i].State = nullptr;
    }

    m_LPC17_Display_VituralRam = nullptr;

    return (const TinyCLR_Api_Info*)&displayApi;;
}

void LPC17_Display_Reset() {
    LPC17_Display_Clear();

    if (m_LPC17_DisplayEnable)
        LPC17_Display_Release(&displayControllers[0]);

    m_LPC17_DisplayEnable = false;
}

